![png](Books_ERD.png)

In [17]:
import pandas as pd
from sqlalchemy import create_engine

from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [18]:
connection = "mysql+pymysql://root:root@localhost/books"
engine = create_engine(connection)

In [20]:
database_exists(connection)

True

In [36]:
df_users = pd.read_csv('data/users.csv')
df_users

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [37]:
df_books = pd.read_csv('data/books.csv')
df_books

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [38]:
df_authors = pd.read_csv('data/authors.csv')
df_authors

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [39]:
df_favorites = pd.read_csv('data/favorites.csv')
df_favorites

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

In [42]:
df_users.to_sql('df_users', engine, if_exists='replace', index=False)

3

In [43]:
df_books.to_sql('df_books', engine, if_exists='replace', index=False)

6

In [44]:
df_authors.to_sql('df_authors', engine, if_exists='replace', index=False)

5

In [45]:
df_favorites.to_sql('df_favorites', engine, if_exists='replace', index=False)

7

In [46]:
q = """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_books
0      df_authors
1        df_books
2    df_favorites
3        df_users

In [48]:
q = """SELECT df_books.title, df_favorites.user_id
FROM df_books
JOIN df_favorites ON df_books.id = df_favorites.book_id
WHERE df_favorites.user_id = 
    (SELECT df_users.id FROM df_users WHERE (df_users.last_name = "Doe" AND df_users.first_name = "John"));

"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1